; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-5-7)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-3 - location
	p0-4 - location
	p1-2 - location
	p2-0 - location
	p2-5 - location
	p3-1 - location
	p3-2 - location
	p4-6 - location
	p5-1 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s5)
	(at driver3 s5)
	(at driver4 s3)
	(at truck1 s3)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s4)
	(empty truck3)
	(at truck4 s3)
	(empty truck4)
	(at truck5 s5)
	(empty truck5)
	(at package1 s1)
	(at package2 s5)
	(at package3 s4)
	(at package4 s4)
	(at package5 s6)
	(at package6 s4)
	(at package7 s6)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(= (time-to-walk s0 p0-3) 38)
	(= (time-to-walk p0-3 s0) 38)
	(= (time-to-walk s3 p0-3) 22)
	(= (time-to-walk p0-3 s3) 22)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(= (time-to-walk s0 p0-4) 94)
	(= (time-to-walk p0-4 s0) 94)
	(= (time-to-walk s4 p0-4) 8)
	(= (time-to-walk p0-4 s4) 8)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 70)
	(= (time-to-walk p1-2 s1) 70)
	(= (time-to-walk s2 p1-2) 46)
	(= (time-to-walk p1-2 s2) 46)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 91)
	(= (time-to-walk p2-0 s2) 91)
	(= (time-to-walk s0 p2-0) 50)
	(= (time-to-walk p2-0 s0) 50)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(= (time-to-walk s2 p2-5) 76)
	(= (time-to-walk p2-5 s2) 76)
	(= (time-to-walk s5 p2-5) 22)
	(= (time-to-walk p2-5 s5) 22)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(= (time-to-walk s3 p3-1) 64)
	(= (time-to-walk p3-1 s3) 64)
	(= (time-to-walk s1 p3-1) 20)
	(= (time-to-walk p3-1 s1) 20)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(= (time-to-walk s3 p3-2) 65)
	(= (time-to-walk p3-2 s3) 65)
	(= (time-to-walk s2 p3-2) 37)
	(= (time-to-walk p3-2 s2) 37)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(= (time-to-walk s4 p4-6) 93)
	(= (time-to-walk p4-6 s4) 93)
	(= (time-to-walk s6 p4-6) 12)
	(= (time-to-walk p4-6 s6) 12)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(= (time-to-walk s5 p5-1) 8)
	(= (time-to-walk p5-1 s5) 8)
	(= (time-to-walk s1 p5-1) 48)
	(= (time-to-walk p5-1 s1) 48)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 14)
	(= (time-to-drive s2 s0) 14)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 65)
	(= (time-to-drive s2 s1) 65)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 79)
	(= (time-to-drive s4 s2) 79)
	(link s3 s2)
	(link s2 s3)
	(= (time-to-drive s3 s2) 88)
	(= (time-to-drive s2 s3) 88)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 56)
	(= (time-to-drive s6 s3) 56)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 62)
	(= (time-to-drive s1 s4) 62)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 53)
	(= (time-to-drive s3 s4) 53)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 14)
	(= (time-to-drive s5 s4) 14)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 94)
	(= (time-to-drive s1 s5) 94)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 7)
	(= (time-to-drive s2 s5) 7)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 8)
	(= (time-to-drive s3 s5) 8)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 45)
	(= (time-to-drive s0 s6) 45)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 90)
	(= (time-to-drive s2 s6) 90)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 45)
	(= (time-to-drive s4 s6) 45)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s3)
	(at driver3 s4)
	(at driver4 s6)
	(at truck1 s6)
	(at truck2 s2)
	(at truck3 s0)
	(at truck4 s3)
	(at truck5 s2)
	(at package1 s3)
	(at package2 s5)
	(at package4 s2)
	(at package5 s5)
	(at package6 s2)
	(at package7 s3)
	))

(:metric minimize (+ (+ (* 3  (total-time)) (* 4  (driven))) (* 3  (walked))))

)

; plan
1. (board-truck driver4 truck1 s3)
   deleted: (at driver4 s3) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 2 of 15
2. (drive-truck truck1 s3 s4 driver4)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   changed: (driven) from 0 to 53
   goals met: 2 of 15
3. (walk driver1 s2 p2-0)
   deleted: (at driver1 s2)
   added: (at driver1 p2-0)
   changed: (walked) from 0 to 91
   goals met: 2 of 15
4. (load-truck package4 truck1 s4)
   deleted: (at package4 s4)
   added: (in package4 truck1)
   goals met: 2 of 15
5. (load-truck package6 truck1 s4)
   deleted: (at package6 s4)
   added: (in package6 truck1)
   goals met: 2 of 15
6. (walk driver3 s5 p5-1)
   deleted: (at driver3 s5)
   added: (at driver3 p5-1)
   changed: (walked) from 91 to 99
   goals met: 2 of 15
7. (walk driver3 p5-1 s1)
   deleted: (at driver3 p5-1)
   added: (at driver3 s1)
   changed: (walked) from 99 to 147
   goals met: 2 of 15
8. (board-truck driver3 truck2 s1)
   deleted: (at driver3 s1) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 2 of 15
9. (drive-truck truck2 s1 s2 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (driven) from 53 to 118
   goals met: 3 of 15
10. (drive-truck truck1 s4 s2 driver4)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   changed: (driven) from 118 to 197
   goals met: 3 of 15
11. (drive-truck truck2 s2 s4 driver3)
   deleted: (at truck2 s2)
   added: (at truck2 s4)
   changed: (driven) from 197 to 276
   goals met: 2 of 15
12. (unload-truck package4 truck1 s2)
   deleted: (in package4 truck1)
   added: (at package4 s2)
   goals met: 3 of 15
13. (disembark-truck driver3 truck2 s4)
   deleted: (driving driver3 truck2)
   added: (at driver3 s4) (empty truck2)
   goals met: 4 of 15
14. (walk driver1 p2-0 s0)
   deleted: (at driver1 p2-0)
   added: (at driver1 s0)
   changed: (walked) from 147 to 197
   goals met: 5 of 15
15. (board-truck driver2 truck5 s5)
   deleted: (at driver2 s5) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 5 of 15
16. (unload-truck package6 truck1 s2)
   deleted: (in package6 truck1)
   added: (at package6 s2)
   goals met: 6 of 15
17. (drive-truck truck5 s5 s2 driver2)
   deleted: (at truck5 s5)
   added: (at truck5 s2)
   changed: (driven) from 276 to 283
   goals met: 7 of 15
18. (drive-truck truck1 s2 s6 driver4)
   deleted: (at truck1 s2)
   added: (at truck1 s6)
   changed: (driven) from 283 to 373
   goals met: 8 of 15
19. (load-truck package7 truck1 s6)
   deleted: (at package7 s6)
   added: (in package7 truck1)
   goals met: 8 of 15
20. (drive-truck truck1 s6 s3 driver4)
   deleted: (at truck1 s6)
   added: (at truck1 s3)
   changed: (driven) from 373 to 429
   goals met: 7 of 15
21. (unload-truck package7 truck1 s3)
   deleted: (in package7 truck1)
   added: (at package7 s3)
   goals met: 8 of 15
22. (drive-truck truck1 s3 s6 driver4)
   deleted: (at truck1 s3)
   added: (at truck1 s6)
   changed: (driven) from 429 to 485
   goals met: 9 of 15
23. (disembark-truck driver4 truck1 s6)
   deleted: (driving driver4 truck1)
   added: (at driver4 s6) (empty truck1)
   goals met: 10 of 15
24. (board-truck driver3 truck3 s4)
   deleted: (at driver3 s4) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 9 of 15
25. (drive-truck truck5 s2 s5 driver2)
   deleted: (at truck5 s2)
   added: (at truck5 s5)
   changed: (driven) from 485 to 492
   goals met: 8 of 15
26. (drive-truck truck3 s4 s6 driver3)
   deleted: (at truck3 s4)
   added: (at truck3 s6)
   changed: (driven) from 492 to 537
   goals met: 8 of 15
27. (load-truck package5 truck3 s6)
   deleted: (at package5 s6)
   added: (in package5 truck3)
   goals met: 8 of 15
28. (drive-truck truck3 s6 s4 driver3)
   deleted: (at truck3 s6)
   added: (at truck3 s4)
   changed: (driven) from 537 to 582
   goals met: 8 of 15
29. (drive-truck truck5 s5 s2 driver2)
   deleted: (at truck5 s5)
   added: (at truck5 s2)
   changed: (driven) from 582 to 589
   goals met: 9 of 15
30. (drive-truck truck3 s4 s5 driver3)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   changed: (driven) from 589 to 603
   goals met: 9 of 15
31. (unload-truck package5 truck3 s5)
   deleted: (in package5 truck3)
   added: (at package5 s5)
   goals met: 10 of 15
32. (drive-truck truck3 s5 s2 driver3)
   deleted: (at truck3 s5)
   added: (at truck3 s2)
   changed: (driven) from 603 to 610
   goals met: 10 of 15
33. (drive-truck truck3 s2 s0 driver3)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   changed: (driven) from 610 to 624
   goals met: 11 of 15
34. (drive-truck truck5 s2 s1 driver2)
   deleted: (at truck5 s2)
   added: (at truck5 s1)
   changed: (driven) from 624 to 689
   goals met: 10 of 15
35. (load-truck package1 truck5 s1)
   deleted: (at package1 s1)
   added: (in package1 truck5)
   goals met: 10 of 15
36. (drive-truck truck5 s1 s4 driver2)
   deleted: (at truck5 s1)
   added: (at truck5 s4)
   changed: (driven) from 689 to 751
   goals met: 10 of 15
37. (disembark-truck driver3 truck3 s0)
   deleted: (driving driver3 truck3)
   added: (at driver3 s0) (empty truck3)
   goals met: 10 of 15
38. (drive-truck truck5 s4 s3 driver2)
   deleted: (at truck5 s4)
   added: (at truck5 s3)
   changed: (driven) from 751 to 804
   goals met: 10 of 15
39. (unload-truck package1 truck5 s3)
   deleted: (in package1 truck5)
   added: (at package1 s3)
   goals met: 11 of 15
40. (disembark-truck driver2 truck5 s3)
   deleted: (driving driver2 truck5)
   added: (at driver2 s3) (empty truck5)
   goals met: 12 of 15
41. (walk driver1 s0 p0-4)
   deleted: (at driver1 s0)
   added: (at driver1 p0-4)
   changed: (walked) from 197 to 291
   goals met: 11 of 15
42. (walk driver3 s0 p0-4)
   deleted: (at driver3 s0)
   added: (at driver3 p0-4)
   changed: (walked) from 291 to 385
   goals met: 11 of 15
43. (walk driver1 p0-4 s4)
   deleted: (at driver1 p0-4)
   added: (at driver1 s4)
   changed: (walked) from 385 to 393
   goals met: 11 of 15
44. (walk driver3 p0-4 s4)
   deleted: (at driver3 p0-4)
   added: (at driver3 s4)
   changed: (walked) from 393 to 401
   goals met: 12 of 15
45. (board-truck driver2 truck5 s3)
   deleted: (at driver2 s3) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 11 of 15
46. (drive-truck truck5 s3 s2 driver2)
   deleted: (at truck5 s3)
   added: (at truck5 s2)
   changed: (driven) from 804 to 892
   goals met: 12 of 15
47. (board-truck driver1 truck2 s4)
   deleted: (at driver1 s4) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 12 of 15
48. (drive-truck truck5 s2 s0 driver2)
   deleted: (at truck5 s2)
   added: (at truck5 s0)
   changed: (driven) from 892 to 906
   goals met: 11 of 15
49. (drive-truck truck2 s4 s2 driver1)
   deleted: (at truck2 s4)
   added: (at truck2 s2)
   changed: (driven) from 906 to 985
   goals met: 12 of 15
50. (drive-truck truck2 s2 s3 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   changed: (driven) from 985 to 1073
   goals met: 11 of 15
51. (disembark-truck driver1 truck2 s3)
   deleted: (driving driver1 truck2)
   added: (at driver1 s3) (empty truck2)
   goals met: 11 of 15
52. (disembark-truck driver2 truck5 s0)
   deleted: (driving driver2 truck5)
   added: (at driver2 s0) (empty truck5)
   goals met: 11 of 15
53. (walk driver2 s0 p0-3)
   deleted: (at driver2 s0)
   added: (at driver2 p0-3)
   changed: (walked) from 401 to 439
   goals met: 11 of 15
54. (walk driver2 p0-3 s3)
   deleted: (at driver2 p0-3)
   added: (at driver2 s3)
   changed: (walked) from 439 to 461
   goals met: 12 of 15
55. (walk driver3 s4 p0-4)
   deleted: (at driver3 s4)
   added: (at driver3 p0-4)
   changed: (walked) from 461 to 469
   goals met: 11 of 15
56. (walk driver3 p0-4 s0)
   deleted: (at driver3 p0-4)
   added: (at driver3 s0)
   changed: (walked) from 469 to 563
   goals met: 11 of 15
57. (board-truck driver1 truck2 s3)
   deleted: (at driver1 s3) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 11 of 15
58. (board-truck driver3 truck5 s0)
   deleted: (at driver3 s0) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 11 of 15
59. (drive-truck truck5 s0 s2 driver3)
   deleted: (at truck5 s0)
   added: (at truck5 s2)
   changed: (driven) from 1073 to 1087
   goals met: 12 of 15
60. (drive-truck truck5 s2 s4 driver3)
   deleted: (at truck5 s2)
   added: (at truck5 s4)
   changed: (driven) from 1087 to 1166
   goals met: 11 of 15
61. (drive-truck truck5 s4 s3 driver3)
   deleted: (at truck5 s4)
   added: (at truck5 s3)
   changed: (driven) from 1166 to 1219
   goals met: 11 of 15
62. (disembark-truck driver3 truck5 s3)
   deleted: (driving driver3 truck5)
   added: (at driver3 s3) (empty truck5)
   goals met: 11 of 15
63. (drive-truck truck2 s3 s2 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   changed: (driven) from 1219 to 1307
   goals met: 12 of 15
64. (disembark-truck driver1 truck2 s2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s2) (empty truck2)
   goals met: 12 of 15
65. (board-truck driver2 truck5 s3)
   deleted: (at driver2 s3) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 11 of 15
66. (drive-truck truck5 s3 s2 driver2)
   deleted: (at truck5 s3)
   added: (at truck5 s2)
   changed: (driven) from 1307 to 1395
   goals met: 12 of 15
67. (disembark-truck driver2 truck5 s2)
   deleted: (driving driver2 truck5)
   added: (at driver2 s2) (empty truck5)
   goals met: 12 of 15
68. (walk driver2 s2 p3-2)
   deleted: (at driver2 s2)
   added: (at driver2 p3-2)
   changed: (walked) from 563 to 600
   goals met: 12 of 15
69. (walk driver2 p3-2 s3)
   deleted: (at driver2 p3-2)
   added: (at driver2 s3)
   changed: (walked) from 600 to 665
   goals met: 13 of 15
70. (board-truck driver2 truck4 s3)
   deleted: (at driver2 s3) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 12 of 15
71. (drive-truck truck4 s3 s4 driver2)
   deleted: (at truck4 s3)
   added: (at truck4 s4)
   changed: (driven) from 1395 to 1448
   goals met: 11 of 15
72. (disembark-truck driver2 truck4 s4)
   deleted: (driving driver2 truck4)
   added: (at driver2 s4) (empty truck4)
   goals met: 11 of 15
73. (walk driver3 s3 p0-3)
   deleted: (at driver3 s3)
   added: (at driver3 p0-3)
   changed: (walked) from 665 to 687
   goals met: 11 of 15
74. (board-truck driver2 truck4 s4)
   deleted: (at driver2 s4) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 11 of 15
75. (drive-truck truck4 s4 s3 driver2)
   deleted: (at truck4 s4)
   added: (at truck4 s3)
   changed: (driven) from 1448 to 1501
   goals met: 12 of 15
76. (walk driver1 s2 p2-0)
   deleted: (at driver1 s2)
   added: (at driver1 p2-0)
   changed: (walked) from 687 to 778
   goals met: 12 of 15
77. (walk driver1 p2-0 s0)
   deleted: (at driver1 p2-0)
   added: (at driver1 s0)
   changed: (walked) from 778 to 828
   goals met: 13 of 15
78. (walk driver3 p0-3 s0)
   deleted: (at driver3 p0-3)
   added: (at driver3 s0)
   changed: (walked) from 828 to 866
   goals met: 13 of 15
79. (disembark-truck driver2 truck4 s3)
   deleted: (driving driver2 truck4)
   added: (at driver2 s3) (empty truck4)
   goals met: 14 of 15
80. (walk driver3 s0 p0-4)
   deleted: (at driver3 s0)
   added: (at driver3 p0-4)
   changed: (walked) from 866 to 960
   goals met: 14 of 15
81. (walk driver3 p0-4 s4)
   deleted: (at driver3 p0-4)
   added: (at driver3 s4)
   changed: (walked) from 960 to 968
   goals met: 15 of 15
